//1. Написати програму, в якій дані варіанту(таблиця 1) структури записуються в             +
//бінарне дерево(використати три поля для вузла – текстове дане та два числові.
//	Наприклад, вузол дерева містить таку корисну інформацію : прізвище студента, рік
//	народження, оцінка по іспиту).Ввести з клавіатури декілька "студентів" у двійкове
//	дерево, організоване за порядком текстового поля.Роздрукувати отримане бінарне
//	дерево.

////////////////////////////

//	2. Знайти середнє значення одного з числових полів, зчитуючи дані з дерева.  -

///////////////////////////

//	3. Надрукувати значення бінарного дерева :          +
//а) при прямому обході дерева;
//б) при зворотному обході дерева;
//в) при симетричному обході дерева.

///////////////////////////

//4. Дописати функцію видалення з пам’яті всього бінарного дерева.           +

///////////////////////////

//5. Створити рекурсивну функцію, яка:
// видаляє ліве піддерево, і ліву гілку занулює;               +
// видаляє праве піддерево, і праву гілку занулює;             +
// видаляє сам вузол, потім зануливши вказівник на нього.      -
//Наприкінці програми видалити з пам’яті дерево.

///////////////////////////

//6. "Пересипати" дані з першого дерева у друге дерево того ж типу, тільки       +
//організованого за першим числовим ключем(напр., рік народження) та
//роздрукувати його(а перше дерево стерти).

///////////////////////////

//7. Розфарбувати вершини заданого бінарного дерева в червоний і чорний          +
//кольори так, щоб воно стало червоно - чорним деревом.

///////////////////////////

//8. Провести перевірку властивості червоно - чорного дерева, а саме :
// кожен вузол промаркований червоним або чорним кольором;                      +
// корінь дерева – чорний;                                                      +
// кінцеві вузли дерева – чорні;
// біля червоного вузла батьківський вузол — чорний;
// усі прості шляхи з будь - якого вузла до листя містять однакову кількість
//чорних вузлів.

///////////////////////////

//9. У червоно - чорному дереві виконати додавання і видаленні вузлів та провести          +
//перевірку властивості червоно - чорного дерева.

///////////////////////////

//Наприкінці програми видалити з пам’яті дерево.