//1. Визначити масив, в якому буде виконуватися пошук.Використовувати
//масив, створений в роботі №4.

//2. Розробити функції лінійного пошуку в масиві, бінарного пошуку в масиві.
//Для забезпечення бінарного пошуку в масиві використовувати найбільш ефективний
//алгоритм сортування, визначений при виконанні лабораторної роботі №4 :
// ввести інформацію в масив з файлу;
// виконати лінійний пошук в масиві;
// виконати пошук з бар'єром;
// упорядкувати елементи масиву функцією сортування і виконати бінарний
//пошук.

//3. Розробити функції для пошуку підрядка в рядку :
// виконати прямий пошук підрядка;
// виконати алгоритм Кнута - Морріса - Пратта;
// виконати алгоритм Бойера - Мура;
// виконати алгоритм Рабина – Карпа.

//4. Дослідити складність алгоритмів.Провести асимптотичний аналіз алгоритмів
//пошуку та зробити висновки.
// для порівняння алгоритмів пошуку виконати наступні кроки;
// створити таблицю асимптотичних оцінок трудомісткості алгоритмів в
//кращому, середньому, гіршому випадках;
// розставити лічильники операцій у функціях пошуку;
// провести експеримент, визначити середню кількість операцій для різних
//алгоритмів, побудувати графіки;
// створити таблиці і представити графіки експериментальних оцінок
//алгоритмів.

//Для всіх випадків перевірити варіанти успішного і неуспішного пошуку.

//Зробити висновки.Зберегти файл з текстом програми для подальших робіт.

//Заборонено використовувати готові реалізації структур даних(наприклад,
//	STL).
