//1. Створити функцію сортування масиву алгоритмами сортування, які треба
//обрати у таблиці 3 відповідно до свого варіанту.Варіант завдання вибирається за   +
//номером студента в списку групи.

//2. Будь - яким способом заповнити елементи масиву значеннями.                     +

//3. Виконати сортування масиву першим алгоритмом і проаналізувати отримані         +
//результати.

//4. Перевірити всі варіанти вихідного заповнення масиву : випадковим чином,        +
//відсортованого у порядку зростання, відсортованого у порядку спадання.
//Переконатися в правильності сортування у всіх випадках.Зробити висновки.

//5. Повторити пункти 2 - 4 для другого та третьего алгоритму сортування.           +

//6. Дослідити складність алгоритмів.Провести асимптотичний аналіз
//алгоритмів сортування та зробити висновки.

//7. Здійснити порівняння алгоритмів сортування для n = 10, 100, 1000, 10000 і в
//наступному порядку вхідних елементів :
// елементи вже впорядковані;
// елементи в зворотному порядку;
// розстановка елементів випадкова.

//8. Виконання порівняння алгоритмів сортування на основі наступних кроків :
// створити таблицю асимптотичних оцінок трудомісткості алгоритмів в
//кращому, середньому, гіршому випадках;
// розставити лічильники операцій у функціях угруповань;
// провести експеримент, визначити середню кількість операцій для різних
//угруповань, побудувати графіки;
// для кожного виклику сортування генерувати новий масив;
// створити таблиці і представити графіки експериментальних оцінок
//алгоритмів.

//Необхідно враховувати, що порівняння алгоритмів проводиться на однакових
//вхідних даних.

//Зберегти файл з тестом програми для подальших робіт.

//Заборонено використовувати готові реалізації структур даних(наприклад,
//	STL).